<template>
<div style="padding: 20px">
    <div>
      当前版本：1.0.8
    </div>
    <h3>版本说明</h3>
    <h4>版本号1.0.8</h4>
    <div>
      <p>修复：</p>
      <p>1.NoverStage音乐播放多个点击播放图标显示问题</p>
      <p>2.创建投放时的提示信息应该改为中文提示 </p>
      <p>3.编辑投放记录时，内容计划展示时间重复校验不严谨</p>
      <p>4.投放记录存在一条状态为启用时，通过列表数据过滤后进行添加新的投放记录时，前端应该抛出接口所返回的错误提示信息</p>
      <p>5.计划展示时间未填写时进行展示规则切换不应给出提示</p>
      <p>6.投放位置和投放方向应限制仅能输入数字</p>
      <p>7.切换位置后，投放信息前端显示有误</p>
    </div>
    <h4>版本号1.0.7</h4>
    <div>
      <p>修复：</p>
      <p>1.地址启用禁用纳入编辑权限</p>
      <p>2.位置管理点击查询清空列表</p>
      <p>3.重置后页面初始化进入状态</p>
      <p>4.AR拍照图片路径报错404</p>
      <p>5.点击页面配置时左侧导航对应不上</p>
      <p>6.应用管理-Nover Stage素材管理，音乐预览后无法停止</p>
      <p>7.修复识别图分页错误问题</p>
      <p>8.修复识别图位置跳转搜索框不清空问题</p>
      <p>9.修复应用管理图片不显示问题</p>
      <p>10.修复应用管理状态搜索字段错误问题</p>
      <p>11.创建投放时的提示信息应该改为中文提示</p >
      <p>12.音乐预览播放一次后无法恢复图标，无法再次播放</p>
      <p>更新：</p>
      <p>1.stage、AR拍照内容列表批量删除后重置回第一页</p>
      <p>2.更新页面显示时间问题</p>
      <p>3.资源包大小转换成单位M</p>
      <p>4.屏幕自适应</p>
    </div>
    <h4>版本号1.0.6</h4>
    <div>
      <p>修复：</p>
      <p>1.ar内容列表增加创建人显示</p>
      <p>2.ar内容列表关键字不起作用</p>
      <p>3.新建场次的时间样式</p>
      <p>4.新增场景，场景模型关联样式</p>
      <p>5.stage场景列表无法分页</p>
      <p>6.音乐排序第一次只能填一个数字</p>
      <p>7.编辑场景-背景音乐无法试听</p>
      <p>8.ar创建内容素材列表去掉歌词、时长字段</p>
      <p>9.地址树节点点击失效，无法新增位置信息</p>
      <p>10.添加投放时，左侧菜单显示错误</p>
      <p>11.AR内容列表下架同一红色</p>
      <p>12.首页“后台"字眼应该改为"中台" </p>   
      <p>13.MP4预览内容未显示 激活</p>  
      <p>14.创建新内容页面有误 激活  添加投放后左侧地址树被收起，建议保持与添加前一致</p>
      <p>15.投放信息无法根据创建时间进行筛查，查询结束数据有误</p>   
      <p>16.动画总时长字段内容未显示</p>
      <p>17.中台应用管理中的动画、场景模型菜单点击时报404</p>
      <p>18.中台-应用管理-Nover Stage素材管理，音乐预览后无法停止</p>
      <p>19.内容计划时分秒控件无法进行滚动选择</p>
      <p>20.修复识别提页面分页点击无反应问题；</p>
      <p>21.修复识别图页面必填字段校验；</p>
      <p>22.修复识别图页面，首次进入时，默认展开所有识别图；</p>
      <p>23.修复应用页面必填字段；</p>
      <p>24.修复应用页面弹窗样式问题。</p>

      <p>更新：</p>
      <p>1.中台创建内容，删除了有效时间</p>
      <p>2.新增、编辑节目增加节目时间判断：判断是否超出场景时间、与其他时间重叠</p>
      <p>3.新增、编辑场景增加场景时间判断：判断是否有节目超出场景时间</p>
      <p>4.新增中台创建内容关联素材列表上下架字段显示，并且下架素材无法选择</p>
      <p>5.音乐播放完自动暂停</p>
      <p>6.投放增加了时间重叠判断，重启和停用判断</p>
    </div>
    <h4>版本号1.0.5</h4>
    <div>
      <p>修复：</p>
      <p>1.修复app管理页面，保存报错bug。</p>
    </div>
    <h4>版本号1.0.4</h4>
    <div>
      <p>修复：</p>
      <p>1.修复强制刷新后页面不显示问题。</p>
    </div>
    <h4>版本号1.0.3</h4>
    <div>
      <p>bug修复</p>
      <p>1.投放管理-》投放列表 初始化进入投放列表的提示信息建议取消</p>
      <p>2.投放管理-》投放列表 投放列表点击位置时前端报错</p>
    </div>
    <h4>版本号1.0.2</h4>
    <div>
      <p>bug修复</p>
      <p>1.部分appId固定未从后端获取</p>
    </div>
    <h4>版本号1.0.1</h4>
    <div>
      <p>bug修复</p>
      <p>1.内容管理所有列表请求方式post</p>
      <p>2.ar内容的素材以及下拉框接口更换</p>
      <p>新增:</p>
      <p>1.app管理权限</p>
    </div>
    <div>
      <p>
        版本号1.0.0
      </p>
      <p>
        完成：完成utopa AR中台相关功能。
      </p>
    </div>
  </div>
</template>

<script>
    export default {
        name: "version"
    }
</script>

<style scoped>

</style>
